using NewLife.JT809.Protocols;

namespace NewLife.JT809.SubMessages;

#warning   8.3.3.2.5 交换车辆行驶路线信息消息  无指定消息子类型，暂未对接
/// <summary>
/// 交换车辆定位信息消息
/// <para>子业务类型标识:DOWN_EXG_MSG_CAR_LOCATION</para>
/// <para>2011 描述:上级平台通过该消息不间断地向车辆驶入区域所属的下级平台发送车辆定位信息，直到该车驶离该区域</para>
/// <para>2019 描述：上级平台在以下四种情况下通过该消息不间断地向车辆进入区域所属的下级平台发送车辆定位信息，直到该车辆离开该区域
/// 1.车辆跨域时，上级平台通过该消息不间断地向车辆进入区域所属的下级平台发送车辆定位信息，直到该车辆离开该区域
/// 2.人工指定车辆定位信息交换时，上级平台通过该消息不间断地向指定交换对象下级平台发送车辆定位信息，直到人工指定“交换车辆定位信息”结束
/// 3.下级平台向上级平台“申请交换指定车辆定位信息”成功后，上级平台通过该消息不间断地向交换对象下级平台发送车辆定位信息，直到“申请交换指定车辆定位信息”结束
/// 4.应急状态监控车辆时，上级平台向车辆归属下级平台通过该消息不间断地发送车辆定位信息，实现车辆定位信息回传
/// </para>
/// <para>2011版数据体见JT/T 809-2011 表30，2019版数据体见JT/T 809-2019 表41，两版结构与主链路 0x1202 一致</para>
/// </summary>
/// <remarks>数据体结构与主链路 0x1202 完全一致，实现见基类 <see cref="JTGnssLocationBody"/></remarks>
[MessageKind(MessageKinds.交换车辆定位信息消息)]
public class JT809_0x9200_0x9202 : JTGnssLocationBody
{
}